package com.lzkydh.text;

import java.util.Arrays;

/**
 * Created by lzk on 2018/3/10 20:10
 * Description:
 */
public class getLabel {
    public static void main(String[] args) {
/*
cxList:["川菜","湘菜","粤菜","闽菜","浙菜","鲁菜","苏菜","徽菜","京菜","天津菜","上海菜","渝菜","东北菜","清真菜","晋菜","赣菜","湖北菜","云南菜","贵州菜","新疆菜","淮扬菜","潮州菜","客家菜","广西菜","西北菜","香港美食","台湾菜","澳门美食","西餐","日本料理","韩国料理","泰国菜","越南菜","意大利菜","墨西哥菜","西班牙菜","法国菜","美国菜","巴西烧烤","东南亚菜","印度菜","伊朗菜","土耳其菜","澳大利亚菜"
,cpList:["家常菜","私房菜","快手菜","热菜","凉菜","蒸菜","创意菜","下饭菜","下酒菜","海鲜","药膳","斋菜","腌菜","农家菜","宫廷菜","婴儿辅食","饭","炒饭","盖浇饭","煲仔饭","粥","面食","面","炒面","粉","饼","油酥类面点","糕点","汤圆","馄饨","馒头","饺子","包子","卷子","烘焙","蛋糕","面包","饼干","披萨","派类","挞类","果冻","布丁","冰淇淋","糖果","点心","零食","汤","羹","炖品","甜品","饮品","冰品","糖水","沙拉","茶饮","酒水","花草茶","果汁","小吃","便当","烧烤","串烧","寿司","拼盘","杂烩","酱汁","果酱","火锅","干锅","香锅","佐料","自制调味料","懒人食谱","包子馅","馄饨馅","饺子馅","水饺馅","粽子","月饼","月饼馅","果茶","石锅拌饭","谭家菜","官府菜","孔府菜"
,kwList:["酸","甜","苦","辣","咸","爽口","清淡","酸甜","咸甜","香甜","微辣","中辣","超辣","麻辣","酸辣","鲜辣","香辣","咸鲜","椒盐","咸香","原味","奶香","葱香","韭香","蒜香","酱香","糟香","五香","蚝香","鱼香","果味","草莓味","香草味","薄荷味","橘子味","番茄味","柠檬味","苹果味","蓝莓味","咖喱味","孜然味","芥末味","黑椒味","姜汁味","茄汁味","烧烤味","红油味","蛋黄味","蟹黄味","糖醋味","泡椒味","怪味","芝士味","抹茶味","芝麻味","巧克力味","糊辣","芒果味","西瓜味","西柚味","水蜜桃味"
,cjList:["炒锅","平底锅","煎锅","蒸锅","汤锅","奶锅","砂锅","炖锅","电火锅","塔吉锅","高压锅","电压力锅","空气炸锅","电饭煲","炖盅","烤箱","冰箱","微波炉","烧烤炉","多士炉","电饼铛","面包机","面条机","榨汁机","料理机","豆浆机","酸奶机","冰淇淋机","咖啡机","刨冰机","厨师机","爆米花机","华夫饼机","保鲜盒","打蛋器","模具"
,gyList:["炒","爆","蒸","烩","涮","炖","熬","煨","煎","焖","烧","溜","熏","腌","炸","烤","拌","汆","煮","烹","煸","烫","酿","酱","卤","泡","冻","贴","卷","扒","焗","烙","灼","炝","滚","浸","干煸","干炒","清炒","滑炒","爆炒","酱爆","葱爆","干煎","红焖","黄焖","葱焖","红烧","酱烧","干烧","葱烧","醋溜","滑溜","铁板","捞汁","拔丝","挂霜","糖渍","压榨","微波","焙","烘","扣","拼","淋","醉","塌"
*/
//String json ="cjList:[\"炒锅\",\"平底锅\",\"煎锅\",\"蒸锅\",\"汤锅\",\"奶锅\",\"砂锅\",\"炖锅\",\"电火锅\",\"塔吉锅\",\"高压锅\",\"电压力锅\",\"空气炸锅\",\"电饭煲\",\"炖盅\",\"烤箱\",\"冰箱\",\"微波炉\",\"烧烤炉\",\"多士炉\",\"电饼铛\",\"面包机\",\"面条机\",\"榨汁机\",\"料理机\",\"豆浆机\",\"酸奶机\",\"冰淇淋机\",\"咖啡机\",\"刨冰机\",\"厨师机\",\"爆米花机\",\"华夫饼机\",\"保鲜盒\",\"打蛋器\",\"模具\"\n";
        String json ="gyList:[\"炒\",\"爆\",\"蒸\",\"烩\",\"涮\",\"炖\",\"熬\",\"煨\",\"煎\",\"焖\",\"烧\",\"溜\",\"熏\",\"腌\",\"炸\",\"烤\",\"拌\",\"汆\",\"煮\",\"烹\",\"煸\",\"烫\",\"酿\",\"酱\",\"卤\",\"泡\",\"冻\",\"贴\",\"卷\",\"扒\",\"焗\",\"烙\",\"灼\",\"炝\",\"滚\",\"浸\",\"干煸\",\"干炒\",\"清炒\",\"滑炒\",\"爆炒\",\"酱爆\",\"葱爆\",\"干煎\",\"红焖\",\"黄焖\",\"葱焖\",\"红烧\",\"酱烧\",\"干烧\",\"葱烧\",\"醋溜\",\"滑溜\",\"铁板\",\"捞汁\",\"拔丝\",\"挂霜\",\"糖渍\",\"压榨\",\"微波\",\"焙\",\"烘\",\"扣\",\"拼\",\"淋\",\"醉\",\"塌\"\n";
        //String json ="kwList:[\"酸\",\"甜\",\"苦\",\"辣\",\"咸\",\"爽口\",\"清淡\",\"酸甜\",\"咸甜\",\"香甜\",\"微辣\",\"中辣\",\"超辣\",\"麻辣\",\"酸辣\",\"鲜辣\",\"香辣\",\"咸鲜\",\"椒盐\",\"咸香\",\"原味\",\"奶香\",\"葱香\",\"韭香\",\"蒜香\",\"酱香\",\"糟香\",\"五香\",\"蚝香\",\"鱼香\",\"果味\",\"草莓味\",\"香草味\",\"薄荷味\",\"橘子味\",\"番茄味\",\"柠檬味\",\"苹果味\",\"蓝莓味\",\"咖喱味\",\"孜然味\",\"芥末味\",\"黑椒味\",\"姜汁味\",\"茄汁味\",\"烧烤味\",\"红油味\",\"蛋黄味\",\"蟹黄味\",\"糖醋味\",\"泡椒味\",\"怪味\",\"芝士味\",\"抹茶味\",\"芝麻味\",\"巧克力味\",\"糊辣\",\"芒果味\",\"西瓜味\",\"西柚味\",\"水蜜桃味\"\n";
System.out.println(json);;
        String [] s = json.split(",");
        String aaa = "insert into label(label_mark,label_name)\nvalues";
        for(String a : s){
            a = a.substring(a.indexOf("\"") + 1,a.lastIndexOf("\""));
            aaa += "(\'工艺\',\'" + a+"\'),\n";
        }
        System.out.println(aaa);
    String str = "cxList: [\n" +
            "        \"川菜\",\n" +
            "        \"湘菜\",\n" +
            "        \"粤菜\",\n" +
            "        \"闽菜\",\n" +
            "        \"浙菜\",\n" +
            "        \"鲁菜\",\n" +
            "        \"苏菜\",\n" +
            "        \"徽菜\",\n" +
            "        \"京菜\",\n" +
            "        \"天津菜\",\n" +
            "        \"上海菜\",\n" +
            "        \"渝菜\",\n" +
            "        \"东北菜\",\n" +
            "        \"清真菜\",\n" +
            "        \"晋菜\",\n" +
            "        \"赣菜\",\n" +
            "        \"湖北菜\",\n" +
            "        \"云南菜\",\n" +
            "        \"贵州菜\",\n" +
            "        \"新疆菜\",\n" +
            "        \"淮扬菜\",\n" +
            "        \"潮州菜\",\n" +
            "        \"客家菜\",\n" +
            "        \"广西菜\",\n" +
            "        \"西北菜\",\n" +
            "        \"香港美食\",\n" +
            "        \"台湾菜\",\n" +
            "        \"澳门美食\",\n" +
            "        \"西餐\",\n" +
            "        \"日本料理\",\n" +
            "        \"韩国料理\",\n" +
            "        \"泰国菜\",\n" +
            "        \"越南菜\",\n" +
            "        \"意大利菜\",\n" +
            "        \"墨西哥菜\",\n" +
            "        \"西班牙菜\",\n" +
            "        \"法国菜\",\n" +
            "        \"美国菜\",\n" +
            "        \"巴西烧烤\",\n" +
            "        \"东南亚菜\",\n" +
            "        \"印度菜\",\n" +
            "        \"伊朗菜\",\n" +
            "        \"土耳其菜\",\n" +
            "        \"澳大利亚菜\"\n" +
            "      ],\n" +
            "      cpList: [\n" +
            "        \"家常菜\",\n" +
            "        \"私房菜\",\n" +
            "        \"快手菜\",\n" +
            "        \"热菜\",\n" +
            "        \"凉菜\",\n" +
            "        \"蒸菜\",\n" +
            "        \"创意菜\",\n" +
            "        \"下饭菜\",\n" +
            "        \"下酒菜\",\n" +
            "        \"海鲜\",\n" +
            "        \"药膳\",\n" +
            "        \"斋菜\",\n" +
            "        \"腌菜\",\n" +
            "        \"农家菜\",\n" +
            "        \"宫廷菜\",\n" +
            "        \"婴儿辅食\",\n" +
            "        \"饭\",\n" +
            "        \"炒饭\",\n" +
            "        \"盖浇饭\",\n" +
            "        \"煲仔饭\",\n" +
            "        \"粥\",\n" +
            "        \"面食\",\n" +
            "        \"面\",\n" +
            "        \"炒面\",\n" +
            "        \"粉\",\n" +
            "        \"饼\",\n" +
            "        \"油酥类面点\",\n" +
            "        \"糕点\",\n" +
            "        \"汤圆\",\n" +
            "        \"馄饨\",\n" +
            "        \"馒头\",\n" +
            "        \"饺子\",\n" +
            "        \"包子\",\n" +
            "        \"卷子\",\n" +
            "        \"烘焙\",\n" +
            "        \"蛋糕\",\n" +
            "        \"面包\",\n" +
            "        \"饼干\",\n" +
            "        \"披萨\",\n" +
            "        \"派类\",\n" +
            "        \"挞类\",\n" +
            "        \"果冻\",\n" +
            "        \"布丁\",\n" +
            "        \"冰淇淋\",\n" +
            "        \"糖果\",\n" +
            "        \"点心\",\n" +
            "        \"零食\",\n" +
            "        \"汤\",\n" +
            "        \"羹\",\n" +
            "        \"炖品\",\n" +
            "        \"甜品\",\n" +
            "        \"饮品\",\n" +
            "        \"冰品\",\n" +
            "        \"糖水\",\n" +
            "        \"沙拉\",\n" +
            "        \"茶饮\",\n" +
            "        \"酒水\",\n" +
            "        \"花草茶\",\n" +
            "        \"果汁\",\n" +
            "        \"小吃\",\n" +
            "        \"便当\",\n" +
            "        \"烧烤\",\n" +
            "        \"串烧\",\n" +
            "        \"寿司\",\n" +
            "        \"拼盘\",\n" +
            "        \"杂烩\",\n" +
            "        \"酱汁\",\n" +
            "        \"果酱\",\n" +
            "        \"火锅\",\n" +
            "        \"干锅\",\n" +
            "        \"香锅\",\n" +
            "        \"佐料\",\n" +
            "        \"自制调味料\",\n" +
            "        \"懒人食谱\",\n" +
            "        \"包子馅\",\n" +
            "        \"馄饨馅\",\n" +
            "        \"饺子馅\",\n" +
            "        \"水饺馅\",\n" +
            "        \"粽子\",\n" +
            "        \"月饼\",\n" +
            "        \"月饼馅\",\n" +
            "        \"果茶\",\n" +
            "        \"石锅拌饭\",\n" +
            "        \"谭家菜\",\n" +
            "        \"官府菜\",\n" +
            "        \"孔府菜\"\n" +
            "      ],\n" +
            "      kwList: [\n" +
            "        \"酸\",\n" +
            "        \"甜\",\n" +
            "        \"苦\",\n" +
            "        \"辣\",\n" +
            "        \"咸\",\n" +
            "        \"爽口\",\n" +
            "        \"清淡\",\n" +
            "        \"酸甜\",\n" +
            "        \"咸甜\",\n" +
            "        \"香甜\",\n" +
            "        \"微辣\",\n" +
            "        \"中辣\",\n" +
            "        \"超辣\",\n" +
            "        \"麻辣\",\n" +
            "        \"酸辣\",\n" +
            "        \"鲜辣\",\n" +
            "        \"香辣\",\n" +
            "        \"咸鲜\",\n" +
            "        \"椒盐\",\n" +
            "        \"咸香\",\n" +
            "        \"原味\",\n" +
            "        \"奶香\",\n" +
            "        \"葱香\",\n" +
            "        \"韭香\",\n" +
            "        \"蒜香\",\n" +
            "        \"酱香\",\n" +
            "        \"糟香\",\n" +
            "        \"五香\",\n" +
            "        \"蚝香\",\n" +
            "        \"鱼香\",\n" +
            "        \"果味\",\n" +
            "        \"草莓味\",\n" +
            "        \"香草味\",\n" +
            "        \"薄荷味\",\n" +
            "        \"橘子味\",\n" +
            "        \"番茄味\",\n" +
            "        \"柠檬味\",\n" +
            "        \"苹果味\",\n" +
            "        \"蓝莓味\",\n" +
            "        \"咖喱味\",\n" +
            "        \"孜然味\",\n" +
            "        \"芥末味\",\n" +
            "        \"黑椒味\",\n" +
            "        \"姜汁味\",\n" +
            "        \"茄汁味\",\n" +
            "        \"烧烤味\",\n" +
            "        \"红油味\",\n" +
            "        \"蛋黄味\",\n" +
            "        \"蟹黄味\",\n" +
            "        \"糖醋味\",\n" +
            "        \"泡椒味\",\n" +
            "        \"怪味\",\n" +
            "        \"芝士味\",\n" +
            "        \"抹茶味\",\n" +
            "        \"芝麻味\",\n" +
            "        \"巧克力味\",\n" +
            "        \"糊辣\",\n" +
            "        \"芒果味\",\n" +
            "        \"西瓜味\",\n" +
            "        \"西柚味\",\n" +
            "        \"水蜜桃味\"\n" +
            "      ],\n" +
            "      cjList: [\n" +
            "        \"炒锅\",\n" +
            "        \"平底锅\",\n" +
            "        \"煎锅\",\n" +
            "        \"蒸锅\",\n" +
            "        \"汤锅\",\n" +
            "        \"奶锅\",\n" +
            "        \"砂锅\",\n" +
            "        \"炖锅\",\n" +
            "        \"电火锅\",\n" +
            "        \"塔吉锅\",\n" +
            "        \"高压锅\",\n" +
            "        \"电压力锅\",\n" +
            "        \"空气炸锅\",\n" +
            "        \"电饭煲\",\n" +
            "        \"炖盅\",\n" +
            "        \"烤箱\",\n" +
            "        \"冰箱\",\n" +
            "        \"微波炉\",\n" +
            "        \"烧烤炉\",\n" +
            "        \"多士炉\",\n" +
            "        \"电饼铛\",\n" +
            "        \"面包机\",\n" +
            "        \"面条机\",\n" +
            "        \"榨汁机\",\n" +
            "        \"料理机\",\n" +
            "        \"豆浆机\",\n" +
            "        \"酸奶机\",\n" +
            "        \"冰淇淋机\",\n" +
            "        \"咖啡机\",\n" +
            "        \"刨冰机\",\n" +
            "        \"厨师机\",\n" +
            "        \"爆米花机\",\n" +
            "        \"华夫饼机\",\n" +
            "        \"保鲜盒\",\n" +
            "        \"打蛋器\",\n" +
            "        \"模具\"\n" +
            "      ],\n" +
            "      gyList: [\n" +
            "        \"炒\",\n" +
            "        \"爆\",\n" +
            "        \"蒸\",\n" +
            "        \"烩\",\n" +
            "        \"涮\",\n" +
            "        \"炖\",\n" +
            "        \"熬\",\n" +
            "        \"煨\",\n" +
            "        \"煎\",\n" +
            "        \"焖\",\n" +
            "        \"烧\",\n" +
            "        \"溜\",\n" +
            "        \"熏\",\n" +
            "        \"腌\",\n" +
            "        \"炸\",\n" +
            "        \"烤\",\n" +
            "        \"拌\",\n" +
            "        \"汆\",\n" +
            "        \"煮\",\n" +
            "        \"烹\",\n" +
            "        \"煸\",\n" +
            "        \"烫\",\n" +
            "        \"酿\",\n" +
            "        \"酱\",\n" +
            "        \"卤\",\n" +
            "        \"泡\",\n" +
            "        \"冻\",\n" +
            "        \"贴\",\n" +
            "        \"卷\",\n" +
            "        \"扒\",\n" +
            "        \"焗\",\n" +
            "        \"烙\",\n" +
            "        \"灼\",\n" +
            "        \"炝\",\n" +
            "        \"滚\",\n" +
            "        \"浸\",\n" +
            "        \"干煸\",\n" +
            "        \"干炒\",\n" +
            "        \"清炒\",\n" +
            "        \"滑炒\",\n" +
            "        \"爆炒\",\n" +
            "        \"酱爆\",\n" +
            "        \"葱爆\",\n" +
            "        \"干煎\",\n" +
            "        \"红焖\",\n" +
            "        \"黄焖\",\n" +
            "        \"葱焖\",\n" +
            "        \"红烧\",\n" +
            "        \"酱烧\",\n" +
            "        \"干烧\",\n" +
            "        \"葱烧\",\n" +
            "        \"醋溜\",\n" +
            "        \"滑溜\",\n" +
            "        \"铁板\",\n" +
            "        \"捞汁\",\n" +
            "        \"拔丝\",\n" +
            "        \"挂霜\",\n" +
            "        \"糖渍\",\n" +
            "        \"压榨\",\n" +
            "        \"微波\",\n" +
            "        \"焙\",\n" +
            "        \"烘\",\n" +
            "        \"扣\",\n" +
            "        \"拼\",\n" +
            "        \"淋\",\n" +
            "        \"醉\",\n" +
            "        \"塌\"\n" +
            "      ]";
        //insertJson(str);

    }

    public static void insertJson(String json){
        StringBuilder sb = new StringBuilder();
        sb.append("insert into label(label_mark,label_name)\nvalues");
        json = json.replace("\n","");
        json = json.replace(" ","");
        int begin = 0;
        int end = json.indexOf("],",begin);
        while (end != -1){
            String array = json.substring(begin,end + 1);
            System.out.println(array);

            int typeIndex = array.indexOf(":");
            String type = array.substring(0,typeIndex);
            System.out.println(type);
            String [] items = array.split(",");
            for (String item :items){
                String name = item.substring(item.indexOf("\"") + 1,item.lastIndexOf("\""));
                System.out.println(name);
                sb.append("(\'" + type + "\',\'" + name+"\'),\n");
            }
            begin = end +2 ;
            end = json.indexOf("],",begin);
        }
        sb.deleteCharAt(sb.length() - 2);
        System.out.println(sb.toString());
    };
}
